In [ ]:
!pip3 install sqlalchemy # ORM for databases
!pip3 install ipython-sql # SQL magic function
%load_ext sql
%sql postgresql://ez2262:0590@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2

Requirement already satisfied: sqlalchemy in /usr/local/lib/python3.7/dist-packages (1.4.35)
Requirement already satisfied: importlib-metadata in /usr/local/lib/python3.7/dist-packages (from sqlalchemy) (4.11.3)
Requirement already satisfied: greenlet!=0.4.17 in /usr/local/lib/python3.7/dist-packages (from sqlalchemy) (1.1.2)
Requirement already satisfied: zipp>=0.5 in /usr/local/lib/python3.7/dist-packages (from importlib-metadata->sqlalchemy) (3.8.0)
Requirement already satisfied: typing-extensions>=3.6.4 in /usr/local/lib/python3.7/dist-packages (from importlib-metadata->sqlalchemy) (4.1.1)
Requirement already satisfied: ipython-sql in /usr/local/lib/python3.7/dist-packages (0.3.9)
Requirement already satisfied: sqlalchemy>=0.6.7 in /usr/local/lib/python3.7/dist-packages (from ipython-sql) (1.4.35)
Requirement already satisfied: sqlparse in /usr/local/lib/python3.7/dist-packages (from ipython-sql) (0.4.2)
Requirement already satisfied: ipython-genutils>=0.1.0 in /usr/local/lib/python3.7/dist-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: ipython>=1.0 in /usr/local/lib/python3.7/dist-packages (from ipython-sql) (5.5.0)
Requirement already satisfied: prettytable in /usr/local/lib/python3.7/dist-packages (from ipython-sql) (3.2.0)
Requirement already satisfied: six in /usr/local/lib/python3.7/dist-packages (from ipython-sql) (1.15.0)
Requirement already satisfied: pygments in /usr/local/lib/python3.7/dist-packages (from ipython>=1.0->ipython-sql) (2.6.1)
Requirement already satisfied: simplegeneric>0.8 in /usr/local/lib/python3.7/dist-packages (from ipython>=1.0->ipython-sql) (0.8.1)
Requirement already satisfied: traitlets>=4.2 in /usr/local/lib/python3.7/dist-packages (from ipython>=1.0->ipython-sql) (5.1.1)
Requirement already satisfied: setuptools>=18.5 in /usr/local/lib/python3.7/dist-packages (from ipython>=1.0->ipython-sql) (57.4.0)
Requirement already satisfied: decorator in /usr/local/lib/python3.7/dist-packages (from ipython>=1.0->ipython-sql) (4.4.2)
Requirement already satisfied: pickleshare in /usr/local/lib/python3.7/dist-packages (from ipython>=1.0->ipython-sql) (0.7.5)
Requirement already satisfied: pexpect in /usr/local/lib/python3.7/dist-packages (from ipython>=1.0->ipython-sql) (4.8.0)
Requirement already satisfied: prompt-toolkit<2.0.0,>=1.0.4 in /usr/local/lib/python3.7/dist-packages (from ipython>=1.0->ipython-sql) (1.0.18)
Requirement already satisfied: wcwidth in /usr/local/lib/python3.7/dist-packages (from prompt-toolkit<2.0.0,>=1.0.4->ipython>=1.0->ipython-sql) (0.2.5)
Requirement already satisfied: greenlet!=0.4.17 in /usr/local/lib/python3.7/dist-packages (from sqlalchemy>=0.6.7->ipython-sql) (1.1.2)
Requirement already satisfied: importlib-metadata in /usr/local/lib/python3.7/dist-packages (from sqlalchemy>=0.6.7->ipython-sql) (4.11.3)
Requirement already satisfied: typing-extensions>=3.6.4 in /usr/local/lib/python3.7/dist-packages (from importlib-metadata->sqlalchemy>=0.6.7->ipython-sql) (4.1.1)
Requirement already satisfied: zipp>=0.5 in /usr/local/lib/python3.7/dist-packages (from importlib-metadata->sqlalchemy>=0.6.7->ipython-sql) (3.8.0)
Requirement already satisfied: ptyprocess>=0.5 in /usr/local/lib/python3.7/dist-packages (from pexpect->ipython>=1.0->ipython-sql) (0.7.0)
The sql extension is already loaded. To reload it, use:
  %reload_ext sql
(psycopg2.OperationalError) FATAL:  remaining connection slots are reserved for non-replication superuser and rds_superuser connections

(Background on this error at: https://sqlalche.me/e/14/e3q8)
Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys(['postgresql://ez2262:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2'])

In [ ]:
%%sql
SELECt * from transactions

 * postgresql://ez2262:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
10 rows affected.

[(1, datetime.date(2022, 3, 20), 'John Jay', 1, 0.0, 0.0, 1),
 (2, datetime.date(2022, 3, 21), 'Ferris', 1, 0.0, 0.0, 1),
 (3, datetime.date(2022, 3, 22), 'Ferris', 1, 0.0, 0.0, 1),
 (4, datetime.date(2022, 3, 22), 'Faculty House', 1, 0.0, 0.0, 2),
 (5, datetime.date(2022, 3, 23), 'Faculty House', 1, 0.0, 0.0, 3),
 (6, datetime.date(2022, 3, 23), 'Hewitt', 1, 0.0, 0.0, 4),
 (7, datetime.date(2022, 3, 24), 'Diana', 1, 0.0, 0.0, 5),
 (8, datetime.date(2022, 3, 24), 'Cafe East', 0, 11.37, 0.0, 6),
 (9, datetime.date(2022, 3, 25), 'Ferris', 1, 0.0, 0.0, 7),
 (10, datetime.date(2022, 3, 25), 'Ferris', 1, 0.0, 0.0, 8)]

In [ ]:
%%sql 
drop table if exists Course, Calendar, Added CASCADE;
CREATE TABLE Course(
    courseID int, 
    department text,
    coursenumber int,
    PRIMARY KEY (courseID)
);

CREATE TABLE Calendar(
  calendarID int,
  start_date date,
  end_date date,
  PRIMARY KEY (calendarID),
  CHECK (start_date <= end_date)
);

CREATE TABLE Added(
  courseID int,
  calendarID int,
  PRIMARY KEY (courseID, calendarID),
  FOREIGN KEY (courseID) REFERENCES Course,
  FOREIGN KEY (calendarID) REFERENCES Calendar
);

 * postgresql://ez2262:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
Done.
Done.
Done.
Done.

[]

In [ ]:
%%sql 
drop table if exists Reviews CASCADE;
CREATE TABLE Reviews(
  reviewID int,
  rating int,
  reviewtext text,
  post_date date,
  courseID int,
  PRIMARY KEY (reviewID, courseID),
  FOREIGN KEY (courseID) REFERENCES Course
    ON DELETE CASCADE
);

 * postgresql://ez2262:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
Done.
Done.

[]

In [ ]:
%%sql
drop table if exists Users CASCADE;
CREATE TABLE Users(
  UNI text,
  name text,
  email text,
  school text,
  department text,
  class_year int,
  PRIMARY KEY (UNI),
  CHECK ((department is null or class_year is null) and (department is not null or class_year is not null))
);

 * postgresql://ez2262:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
Done.
Done.

[]

In [ ]:
%%sql 
drop table if exists Teach, Enroll_Course CASCADE;
CREATE TABLE Teach(
  UNI text NOT NULL,
  courseID int,
  PRIMARY KEY (courseID),
  FOREIGN KEY (courseID) REFERENCES Course,
  FOREIGN KEY (UNI) REFERENCES Users 
);

CREATE TABLE Enroll_Course(
  UNI text NOT NULL,
  courseID int,
  PRIMARY KEY (UNI, courseID),
  FOREIGN KEY (courseID) REFERENCES Course,
  FOREIGN KEY (UNI) REFERENCES Users 
);

 * postgresql://ez2262:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
Done.
Done.
Done.

[]

In [ ]:
%%sql
drop table if exists Write CASCADE;
CREATE TABLE Write(
  UNI text NOT NULL,
  courseID int,
  reviewID int,
  PRIMARY KEY (reviewID, courseID),
  FOREIGN KEY (reviewID, courseID) REFERENCES Reviews,
  FOREIGN KEY (UNI) REFERENCES Users
);

 * postgresql://ez2262:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
Done.
Done.

[]

In [ ]:
%%sql
drop table if exists NewStudentChecklist_Completed CASCADE;
CREATE TABLE NewStudentChecklist_Completed(
  checklistID int,
  description text,
  completed bool, 
  UNI text,
  PRIMARY KEY (checklistID, UNI),
  FOREIGN KEY (UNI) REFERENCES Users
    ON DELETE CASCADE
);

 * postgresql://ez2262:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
Done.
Done.

[]

In [ ]:
%%sql
drop table if exists RegistrationAppointment, Assigned CASCADE;
CREATE TABLE RegistrationAppointment(
  appointmentID int,
  startTime timestamp,
  endTime timestamp,
  appointmentType text,
  PRIMARY KEY (appointmentID),
  CHECK (startTime < endTime)
);

CREATE TABLE Assigned(
  appointmentID int,
  UNI text,
  PRIMARY KEY (appointmentID, UNI),
  FOREIGN KEY (UNI) REFERENCES Users
);

 * postgresql://ez2262:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
Done.
Done.
Done.

[]

In [ ]:
%%sql
drop table if exists DiningPlan, Enroll_Plan CASCADE;
CREATE TABLE DiningPlan(
  planID int,
  swipes int CHECK (swipes>=0),
  dining_dollars float4 CHECK (dining_dollars>=0),
  flex_dollars float4 CHECK (dining_dollars>=0),
  PRIMARY KEY (planID)
);

CREATE TABLE Enroll_Plan(
  UNI text UNIQUE NOT NULL,
  planID int UNIQUE NOT NULL,
  PRIMARY KEY (UNI, planID),
  FOREIGN KEY (UNI) REFERENCES Users,
  FOREIGN KEY (planID) REFERENCES DiningPlan
);

 * postgresql://ez2262:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
Done.
Done.
Done.

[]

In [ ]:
%%sql
drop table if exists Transactions CASCADE;
CREATE TABLE Transactions(
  transactionID int,
  time date,
  location text,
  num_swipes int CHECK (num_swipes>=0),
  num_dining_dollars float4 CHECK (num_dining_dollars>=0),
  num_flex_dollars float4 CHECK (num_flex_dollars>=0),
  planID int,
  PRIMARY KEY (transactionID, planID),
  FOREIGN KEY (planID) REFERENCES DiningPlan
   ON DELETE CASCADE
);

 * postgresql://ez2262:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
Done.
Done.

[]

In [ ]:
%%sql
drop table if exists Unit CASCADE;
CREATE TABLE Unit(
  unitNumber int,
  unitName text,

  courseID int,
  PRIMARY KEY (unitNumber, courseID),
  FOREIGN KEY (courseID) REFERENCES Course
    ON DELETE CASCADE
);

drop table if exists Lesson CASCADE;
CREATE TABLE Lesson(
  lessonNumber int,
  lessonName text,
  lessonText text,

  courseID int,
  unitNumber int,
  PRIMARY KEY (lessonNumber, unitNumber, courseID),
  FOREIGN KEY (unitNumber, courseID) REFERENCES Unit
    ON DELETE CASCADE
);

drop table if exists Assignment CASCADE;
CREATE TABLE Assignment(
  assignmentNumber int,
  assignmentName text,
  assignmentDescription text,

  courseID int,
  lessonNumber int,
  unitNumber int,
  PRIMARY KEY (assignmentNumber, lessonNumber, unitNumber, courseID),
  FOREIGN KEY (lessonNumber, unitNumber, courseID) REFERENCES Lesson
    ON DELETE CASCADE
);

drop table if exists Question CASCADE;
CREATE TABLE Question(
  questionNumber int,
  questionContent text,
  questionAnswer text,
  questionPoints int CHECK (questionPoints>=0),

  courseID int,
  assignmentNumber int,
  lessonNumber int,
  unitNumber int,
  PRIMARY KEY (questionNumber, assignmentNumber, lessonNumber, unitNumber, courseID),
  FOREIGN KEY (assignmentNumber, lessonNumber, unitNumber, courseID) REFERENCES Assignment
    ON DELETE CASCADE
);

 * postgresql://ez2262:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.

[]

In [ ]:
%%sql
drop table if exists Syllabus, Contain_Syllabus;
CREATE TABLE Syllabus(
  syllabusID int,
  content text,
  PRIMARY KEY (syllabusID)
);
CREATE TABLE Contain_Syllabus(
  syllabusID int UNIQUE NOT NULL REFERENCES Syllabus,
  courseID int UNIQUE NOT NULL REFERENCES Course,
  PRIMARY KEY (courseID, syllabusID)
);

 * postgresql://ez2262:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
Done.
Done.
Done.

[]

In [ ]:
%%sql 
 
DELETE FROM Syllabus;
INSERT INTO
  Syllabus(syllabusID, content)
VALUES
  (1, 'We will be discussing the long-term effects of the COVID-19 Pandemic...'),
  (2, 'This class discusses the object oriented programming framework...'),
  (3, 'We will be learning the programming language Python...'),
  (4, 'This class is about databases and SQL....'),
  (5, 'We will do a deep dive into game theory...'),
  (6, 'This is a class focused on the principles of economics...'),
  (7, 'We examine Ordinary Differential Equations and their applications in economics...'),
  (8, 'We examine the Newtonian fluid dynamics...'),
  (9, 'We will be learning about the theories of relativity...'),
  (10, 'We will discuss Eastern Art in the 19th and 20th centuries...')
RETURNING *;

 * postgresql://ez2262:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
0 rows affected.
10 rows affected.

[(1, 'We will be discussing the long-term effects of the COVID-19 Pandemic...'),
 (2, 'This class discusses the object oriented programming framework...'),
 (3, 'We will be learning the programming language Python...'),
 (4, 'This class is about databases and SQL....'),
 (5, 'We will do a deep dive into game theory...'),
 (6, 'This is a class focused on the principles of economics...'),
 (7, 'We examine Ordinary Differential Equations and their applications in economics...'),
 (8, 'We examine the Newtonian fluid dynamics...'),
 (9, 'We will be learning about the theories of relativity...'),
 (10, 'We will discuss Eastern Art in the 19th and 20th centuries...')]

In [ ]:
%%sql

DELETE FROM Course;
INSERT INTO
  Course(courseID, department, coursenumber)
VALUES
  (1, 'COMS', 1004),
  (2, 'COMS', 3134),
  (3, 'COMS', 4111),
  (4, 'COMS', 4170),
  (5, 'ECON', 1105),
  (6, 'ECON', 3211),
  (7, 'ECON', 3265),
  (8, 'PHYS', 1001),
  (9, 'PHYS', 1402),
  (10, 'BMEN', 3020)
RETURNING *;

DELETE FROM Calendar;
INSERT INTO
  Calendar(calendarID, start_date, end_date)
VALUES
  (1, '2022-01-18', '2022-05-02'),
  (2, '2021-08-25', '2021-12-12'),
  (3, '2021-01-16', '2021-05-04'),
  (4, '2020-08-27', '2020-12-10'),
  (5, '2020-01-14', '2020-05-01'),
  (6, '2019-08-22', '2019-12-16'),
  (7, '2019-01-20', '2019-05-06'),
  (8, '2018-08-22', '2018-12-11'),
  (9, '2018-01-18', '2018-05-04'),
  (10, '2017-08-23', '2017-12-17')
RETURNING *;

 * postgresql://ez2262:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
0 rows affected.
10 rows affected.
0 rows affected.
10 rows affected.

[(1, datetime.date(2022, 1, 18), datetime.date(2022, 5, 2)),
 (2, datetime.date(2021, 8, 25), datetime.date(2021, 12, 12)),
 (3, datetime.date(2021, 1, 16), datetime.date(2021, 5, 4)),
 (4, datetime.date(2020, 8, 27), datetime.date(2020, 12, 10)),
 (5, datetime.date(2020, 1, 14), datetime.date(2020, 5, 1)),
 (6, datetime.date(2019, 8, 22), datetime.date(2019, 12, 16)),
 (7, datetime.date(2019, 1, 20), datetime.date(2019, 5, 6)),
 (8, datetime.date(2018, 8, 22), datetime.date(2018, 12, 11)),
 (9, datetime.date(2018, 1, 18), datetime.date(2018, 5, 4)),
 (10, datetime.date(2017, 8, 23), datetime.date(2017, 12, 17))]

In [ ]:
%%sql
DELETE FROM Added;
INSERT INTO
  Added(courseID, calendarID)
VALUES
  (1, 1),
  (2, 2),
  (3, 3),
  (4, 4),
  (5, 1),
  (6, 1),
  (7, 8),
  (8, 9),
  (9, 9),
  (10, 10)
RETURNING *;

 * postgresql://ez2262:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
0 rows affected.
10 rows affected.

[(1, 1),
 (2, 2),
 (3, 3),
 (4, 4),
 (5, 1),
 (6, 1),
 (7, 8),
 (8, 9),
 (9, 9),
 (10, 10)]

In [ ]:
%%sql
DELETE FROM Reviews;
INSERT INTO
  Reviews(reviewID, rating, reviewtext, post_date, courseID)
VALUES
  (1, 5, 'amazing class', '2022-03-02', 1),
  (2, 1, 'horrible class', '2022-02-02', 1),
  (3, 3, 'could be better but good', '2022-01-02', 1),
  (4, 5, 'great teacher', '2021-01-01', 2),
  (5, 1, 'worst class ever', '2020-04-01', 3),
  (6, 1, 'hated it', '2020-06-07', 4),
  (7, 4, 'chill', '2021-09-08', 5),
  (8, 2, 'ehhhhh', '2018-03-05', 6),
  (9, 3, 'so-so', '2022-01-09', 7),
  (10, 5, 'excellent', '2022-02-02', 8)
RETURNING *;

 * postgresql://ez2262:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
0 rows affected.
10 rows affected.

[(1, 5, 'amazing class', datetime.date(2022, 3, 2), 1),
 (2, 1, 'horrible class', datetime.date(2022, 2, 2), 1),
 (3, 3, 'could be better but good', datetime.date(2022, 1, 2), 1),
 (4, 5, 'great teacher', datetime.date(2021, 1, 1), 2),
 (5, 1, 'worst class ever', datetime.date(2020, 4, 1), 3),
 (6, 1, 'hated it', datetime.date(2020, 6, 7), 4),
 (7, 4, 'chill', datetime.date(2021, 9, 8), 5),
 (8, 2, 'ehhhhh', datetime.date(2018, 3, 5), 6),
 (9, 3, 'so-so', datetime.date(2022, 1, 9), 7),
 (10, 5, 'excellent', datetime.date(2022, 2, 2), 8)]

In [ ]:

%%sql 
DELETE FROM Users;
INSERT INTO
  Users(UNI, name, email, school, department, class_year)
VALUES
  ('ez2262', 'Ethan Zhang', 'ez2262@columbia.edu', 'CC', NULL, 2024),
  ('aa1001', 'Abby Arnold', 'aa1001@columbia.edu', 'SEAS', NULL, 2023),
  ('bb1001', 'Bobby Bill', 'bb1001@columbia.edu', 'GS', NULL, 2022),
  ('cc1001', 'Charlie Cox', 'cc1001@columbia.edu', 'CC', NULL, 2022),
  ('dd1001', 'Dorothy Dickinson', 'dd1001@columbia.edu', 'BUS', 'Finance', NULL),
  ('ee1001', 'Eric Edgar', 'ee1001@columbia.edu', 'GSAS', NULL, 2026),
  ('ff1001', 'Fanny Field', 'ff1001@columbia.edu', 'SEAS', 'COMS', NULL),
  ('gg1001', 'George Garrett', 'gg1001@columbia.edu', 'SEAS', 'BMEN', NULL),
  ('hh1001', 'Henry Hicks', 'hh1001@columbia.edu', 'CC', 'PHYS', NULL),
  ('ii1001', 'Ian Illinois', 'ii1001@columbia.edu', 'CC', 'ECON', NULL)
RETURNING *;

 * postgresql://ez2262:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
0 rows affected.
10 rows affected.

[('ez2262', 'Ethan Zhang', 'ez2262@columbia.edu', 'CC', None, 2024),
 ('aa1001', 'Abby Arnold', 'aa1001@columbia.edu', 'SEAS', None, 2023),
 ('bb1001', 'Bobby Bill', 'bb1001@columbia.edu', 'GS', None, 2022),
 ('cc1001', 'Charlie Cox', 'cc1001@columbia.edu', 'CC', None, 2022),
 ('dd1001', 'Dorothy Dickinson', 'dd1001@columbia.edu', 'BUS', 'Finance', None),
 ('ee1001', 'Eric Edgar', 'ee1001@columbia.edu', 'GSAS', None, 2026),
 ('ff1001', 'Fanny Field', 'ff1001@columbia.edu', 'SEAS', 'COMS', None),
 ('gg1001', 'George Garrett', 'gg1001@columbia.edu', 'SEAS', 'BMEN', None),
 ('hh1001', 'Henry Hicks', 'hh1001@columbia.edu', 'CC', 'PHYS', None),
 ('ii1001', 'Ian Illinois', 'ii1001@columbia.edu', 'CC', 'ECON', None)]

In [ ]:
%%sql 
DELETE FROM Teach;
INSERT INTO
  Teach(UNI, courseID)
VALUES
  ('ff1001', 1),
  ('ff1001', 2),
  ('ff1001', 3),
  ('ff1001', 4),
  ('ii1001', 5),
  ('ii1001', 6),
  ('ii1001', 7),
  ('hh1001', 8),
  ('hh1001', 9),
  ('gg1001', 10)
RETURNING *;

 * postgresql://ez2262:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
0 rows affected.
10 rows affected.

[('ff1001', 1),
 ('ff1001', 2),
 ('ff1001', 3),
 ('ff1001', 4),
 ('ii1001', 5),
 ('ii1001', 6),
 ('ii1001', 7),
 ('hh1001', 8),
 ('hh1001', 9),
 ('gg1001', 10)]

In [ ]:
%%sql 
DELETE FROM Enroll_Course;
INSERT INTO
  Enroll_Course(UNI, courseID)
VALUES
  ('ez2262', 1),
  ('ez2262', 2),
  ('ez2262', 3),
  ('ez2262', 5),
  ('aa1001', 5),
  ('aa1001', 2),
  ('bb1001', 7),
  ('bb1001', 10),
  ('cc1001', 1),
  ('cc1001', 5)
RETURNING *;

 * postgresql://ez2262:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
0 rows affected.
10 rows affected.

[('ez2262', 1),
 ('ez2262', 2),
 ('ez2262', 3),
 ('ez2262', 5),
 ('aa1001', 5),
 ('aa1001', 2),
 ('bb1001', 7),
 ('bb1001', 10),
 ('cc1001', 1),
 ('cc1001', 5)]

In [ ]:
%%sql
DELETE FROM Write;
INSERT INTO
  Write(UNI, courseID, reviewID)
VALUES
  ('ez2262', 1, 1),
  ('aa1001', 1, 2),
  ('bb1001', 1, 3),
  ('ez2262', 2, 4),
  ('cc1001', 3, 5),
  ('dd1001', 4, 6),
  ('ee1001', 5, 7),
  ('ff1001', 6, 8),
  ('gg1001', 7, 9),
  ('hh1001', 8, 10)
RETURNING *;

 * postgresql://ez2262:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
0 rows affected.
10 rows affected.

[('ez2262', 1, 1),
 ('aa1001', 1, 2),
 ('bb1001', 1, 3),
 ('ez2262', 2, 4),
 ('cc1001', 3, 5),
 ('dd1001', 4, 6),
 ('ee1001', 5, 7),
 ('ff1001', 6, 8),
 ('gg1001', 7, 9),
 ('hh1001', 8, 10)]

In [ ]:
%%sql
DELETE FROM NewStudentChecklist_Completed;
INSERT INTO
  NewStudentChecklist_Completed(checklistID, description, completed, UNI)
VALUES
  (1, 'Vaccines', true, 'ez2262'),
  (2, 'Deposit', true, 'ez2262'),
  (3, 'Activate UNI', true, 'ez2262'),
  (4, 'Submit transcripts', true, 'ez2262'),
  (5, 'Upload ID photo', true, 'ez2262'),
  (1, 'Vaccines', true, 'cc1001'),
  (2, 'Deposit', true, 'cc1001'),
  (5, 'Upload ID photo', true, 'ee1001'),
  (2, 'Vaccines', true, 'ee1001'),
  (3, 'Activate UNI', true, 'ee1001'),
  (1, 'Vaccines', false, 'dd1001')
RETURNING *;

 * postgresql://ez2262:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
0 rows affected.
11 rows affected.

[(1, 'Vaccines', True, 'ez2262'),
 (2, 'Deposit', True, 'ez2262'),
 (3, 'Activate UNI', True, 'ez2262'),
 (4, 'Submit transcripts', True, 'ez2262'),
 (5, 'Upload ID photo', True, 'ez2262'),
 (1, 'Vaccines', True, 'cc1001'),
 (2, 'Deposit', True, 'cc1001'),
 (5, 'Upload ID photo', True, 'ee1001'),
 (2, 'Vaccines', True, 'ee1001'),
 (3, 'Activate UNI', True, 'ee1001'),
 (1, 'Vaccines', False, 'dd1001')]

In [ ]:

%%sql
DELETE FROM RegistrationAppointment;
INSERT INTO
  RegistrationAppointment(appointmentID, startTime, endTime, appointmentType)
VALUES
  (1, '2021-09-28 09:00:00', '2021-09-28 18:00:00', 'Add/Drop'),
  (2, '2021-09-28 11:00:00', '2021-09-28 18:00:00', 'Add/Drop'),
  (3, '2021-09-28 12:00:00', '2021-09-28 18:00:00', 'Add/Drop'),
  (4, '2021-09-28 13:00:00', '2021-09-28 18:00:00', 'Add/Drop'),
  (5, '2021-09-28 14:00:00', '2021-09-28 18:00:00', 'Add/Drop'),
  (6, '2021-09-28 15:00:00', '2021-09-28 18:00:00', 'Add/Drop'),
  (7, '2021-09-28 16:00:00', '2021-09-28 18:00:00', 'Add/Drop'),
  (8, '2021-09-29 09:00:00', '2021-09-29 18:00:00', 'Add/Drop'),
  (9, '2021-09-30 09:00:00', '2021-09-30 18:00:00', 'Add/Drop'),
  (10, '2021-09-30 09:00:00', '2021-09-30 18:00:00', 'Change of Period')
RETURNING *;

 * postgresql://ez2262:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
0 rows affected.
10 rows affected.

[(1, datetime.datetime(2021, 9, 28, 9, 0), datetime.datetime(2021, 9, 28, 18, 0), 'Add/Drop'),
 (2, datetime.datetime(2021, 9, 28, 11, 0), datetime.datetime(2021, 9, 28, 18, 0), 'Add/Drop'),
 (3, datetime.datetime(2021, 9, 28, 12, 0), datetime.datetime(2021, 9, 28, 18, 0), 'Add/Drop'),
 (4, datetime.datetime(2021, 9, 28, 13, 0), datetime.datetime(2021, 9, 28, 18, 0), 'Add/Drop'),
 (5, datetime.datetime(2021, 9, 28, 14, 0), datetime.datetime(2021, 9, 28, 18, 0), 'Add/Drop'),
 (6, datetime.datetime(2021, 9, 28, 15, 0), datetime.datetime(2021, 9, 28, 18, 0), 'Add/Drop'),
 (7, datetime.datetime(2021, 9, 28, 16, 0), datetime.datetime(2021, 9, 28, 18, 0), 'Add/Drop'),
 (8, datetime.datetime(2021, 9, 29, 9, 0), datetime.datetime(2021, 9, 29, 18, 0), 'Add/Drop'),
 (9, datetime.datetime(2021, 9, 30, 9, 0), datetime.datetime(2021, 9, 30, 18, 0), 'Add/Drop'),
 (10, datetime.datetime(2021, 9, 30, 9, 0), datetime.datetime(2021, 9, 30, 18, 0), 'Change of Period')]

In [ ]:
%%sql
DELETE FROM Assigned;
INSERT INTO
  Assigned(appointmentID, UNI)
VALUES
  (1, 'ez2262'),
  (1, 'aa1001'),
  (1, 'bb1001'),
  (2, 'cc1001'),
  (3, 'dd1001'),
  (4, 'ee1001'),
  (5, 'ff1001'),
  (6, 'gg1001'),
  (7, 'hh1001'),
  (8, 'ii1001')
RETURNING *;

 * postgresql://ez2262:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
0 rows affected.
10 rows affected.

[(1, 'ez2262'),
 (1, 'aa1001'),
 (1, 'bb1001'),
 (2, 'cc1001'),
 (3, 'dd1001'),
 (4, 'ee1001'),
 (5, 'ff1001'),
 (6, 'gg1001'),
 (7, 'hh1001'),
 (8, 'ii1001')]

In [ ]:
%%sql
DELETE FROM DiningPlan;
INSERT INTO
  DiningPlan(planID, swipes, dining_dollars, flex_dollars)
VALUES
  (1, 100, 20.5, 30.92),
  (2, 73, 0, 0),
  (3, 125, 30, 0),
  (4, 85, 15, 0),
  (5, 7, 92, 142),
  (6, 294, 194.2, 0),
  (7, 29, 93, 20),
  (8, 94, 26.53, 83),
  (9, 28, 0, 10),
  (10, 13, 0, 10)
RETURNING *;

 * postgresql://ez2262:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
0 rows affected.
10 rows affected.

[(1, 100, 20.5, 30.92),
 (2, 73, 0.0, 0.0),
 (3, 125, 30.0, 0.0),
 (4, 85, 15.0, 0.0),
 (5, 7, 92.0, 142.0),
 (6, 294, 194.2, 0.0),
 (7, 29, 93.0, 20.0),
 (8, 94, 26.53, 83.0),
 (9, 28, 0.0, 10.0),
 (10, 13, 0.0, 10.0)]

In [ ]:
%%sql
DELETE FROM Enroll_Plan;
INSERT INTO
  Enroll_Plan(UNI, planID)
VALUES
  ('ez2262', 1),
  ('aa1001', 2),
  ('bb1001', 3),
  ('cc1001', 4),
  ('dd1001', 5),
  ('ee1001', 6),
  ('ff1001', 7),
  ('gg1001', 8),
  ('hh1001', 9),
  ('ii1001', 10)
RETURNING *;

 * postgresql://ez2262:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
0 rows affected.
10 rows affected.

[('ez2262', 1),
 ('aa1001', 2),
 ('bb1001', 3),
 ('cc1001', 4),
 ('dd1001', 5),
 ('ee1001', 6),
 ('ff1001', 7),
 ('gg1001', 8),
 ('hh1001', 9),
 ('ii1001', 10)]

In [ ]:
%%sql
DELETE FROM Transactions;
INSERT INTO
  Transactions(transactionID, time, location, num_swipes, num_dining_dollars, num_flex_dollars, planID)
VALUES
  (1, '2022-03-20', 'John Jay', 1, 0, 0, 1),
  (2, '2022-03-21', 'Ferris', 1, 0, 0, 1),
  (3, '2022-03-22', 'Ferris', 1, 0, 0, 1),
  (4, '2022-03-22', 'Faculty House', 1, 0, 0, 2),
  (5, '2022-03-23', 'Faculty House', 1, 0, 0, 3),
  (6, '2022-03-23', 'Hewitt', 1, 0, 0, 4),
  (7, '2022-03-24', 'Diana', 1, 0, 0, 5),
  (8, '2022-03-24', 'Cafe East', 0, 11.37, 0, 6),
  (9, '2022-03-25', 'Ferris', 1, 0, 0, 7),
  (10, '2022-03-25', 'Ferris', 1, 0, 0, 8)
RETURNING *;

 * postgresql://ez2262:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
0 rows affected.
10 rows affected.

[(1, datetime.date(2022, 3, 20), 'John Jay', 1, 0.0, 0.0, 1),
 (2, datetime.date(2022, 3, 21), 'Ferris', 1, 0.0, 0.0, 1),
 (3, datetime.date(2022, 3, 22), 'Ferris', 1, 0.0, 0.0, 1),
 (4, datetime.date(2022, 3, 22), 'Faculty House', 1, 0.0, 0.0, 2),
 (5, datetime.date(2022, 3, 23), 'Faculty House', 1, 0.0, 0.0, 3),
 (6, datetime.date(2022, 3, 23), 'Hewitt', 1, 0.0, 0.0, 4),
 (7, datetime.date(2022, 3, 24), 'Diana', 1, 0.0, 0.0, 5),
 (8, datetime.date(2022, 3, 24), 'Cafe East', 0, 11.37, 0.0, 6),
 (9, datetime.date(2022, 3, 25), 'Ferris', 1, 0.0, 0.0, 7),
 (10, datetime.date(2022, 3, 25), 'Ferris', 1, 0.0, 0.0, 8)]

In [ ]:
%%sql
DELETE FROM Unit;
INSERT INTO
  Unit(unitName, unitNumber, courseID)
VALUES
  ('Basic syntax', 1, 1),
  ('Boolean logic', 2, 1),
  ('If/else statements', 3, 1),
  ('Introduction', 1, 3),
  ('ER Models', 2, 3),
  ('Data Models', 3, 3),
  ('Relational Algebra', 4, 3),
  ('SQL', 5, 3),
  ('APIs', 6, 3),
  ('Introduction', 1, 9)
RETURNING *;

 * postgresql://ez2262:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
0 rows affected.
10 rows affected.

[(1, 'Basic syntax', 1),
 (2, 'Boolean logic', 1),
 (3, 'If/else statements', 1),
 (1, 'Introduction', 3),
 (2, 'ER Models', 3),
 (3, 'Data Models', 3),
 (4, 'Relational Algebra', 3),
 (5, 'SQL', 3),
 (6, 'APIs', 3),
 (1, 'Introduction', 9)]

In [ ]:
%%sql
DELETE FROM Lesson;
INSERT INTO
  Lesson(lessonName, lessonText, lessonNumber, unitNumber, courseID)
VALUES
  ('Hello world program', 'In this lesson, we will be coding our first hello world program in Java.', 1, 1, 1),
  ('Boolean values', 'In this lesson, we will be learning about the two boolean values: true and false.', 1, 2, 1),
  ('Boolean operators', 'Next, we will be learning about boolean operators like || and &&.', 2, 2, 1),
  ('Boolean use cases', 'Today, we will learn about what booleans so important in programming', 3, 2, 1),
  ('If statements', 'We will learn about one of the fundamental aspects of programming logic: if statements.', 1, 3, 1),
  ('Else statements', 'Else statements are the corresponding pair to if statements.', 2, 3, 1),
  ('Else if statements', 'Else if allows us to create a chain of conditionals.', 3, 3, 1),
  ('Welcome!', 'Welcome to the course! Let me introduce myself.', 1, 1, 3),
  ('Intro to ER Models', 'Today, we will learn about what ER models look like and what they do.', 1, 2, 3),
  ('Intro to Data Models', 'Next, we will learn about what data models are', 1, 3, 3)
RETURNING *;

 * postgresql://ez2262:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
0 rows affected.
10 rows affected.

[(1, 'Hello world program', 'In this lesson, we will be coding our first hello world program in Java.', 1, 1),
 (1, 'Boolean values', 'In this lesson, we will be learning about the two boolean values: true and false.', 1, 2),
 (2, 'Boolean operators', 'Next, we will be learning about boolean operators like || and &&.', 1, 2),
 (3, 'Boolean use cases', 'Today, we will learn about what booleans so important in programming', 1, 2),
 (1, 'If statements', 'We will learn about one of the fundamental aspects of programming logic: if statements.', 1, 3),
 (2, 'Else statements', 'Else statements are the corresponding pair to if statements.', 1, 3),
 (3, 'Else if statements', 'Else if allows us to create a chain of conditionals.', 1, 3),
 (1, 'Welcome!', 'Welcome to the course! Let me introduce myself.', 3, 1),
 (1, 'Intro to ER Models', 'Today, we will learn about what ER models look like and what they do.', 3, 2),
 (1, 'Intro to Data Models', 'Next, we will learn about what data models are', 3, 3)]

In [ ]:
%%sql
DELETE FROM Assignment;
INSERT INTO
  Assignment(assignmentName, assignmentDescription, assignmentNumber, lessonNumber, unitNumber, courseID)
VALUES
  ('Hello world assignment', 'Let us try coding hello world by ourselves.', 1, 1, 1, 1),
  ('Boolean values assignment', 'Test your knowledge of boolean value basics.', 1, 1, 2, 1),
  ('Boolean operators assignment', 'Let us see if you understand boolean operators.', 1, 2, 2, 1),
  ('Boolean use cases assignment', 'Assess your knowledge of boolean use cases.', 1, 3, 2, 1),
  ('If statements assignment', 'Give if statements a try yourself.', 1, 1, 3, 1),
  ('Else statements assignment', 'Give else statements a try yourself.', 1, 2, 3, 1),
  ('Else if statements assignment', 'Try else if statements', 1, 3, 3, 1),
  ('Welcome assignment', 'Ensure you understand the syllabus and other course content.', 1, 1, 1, 3),
  ('Intro to ER Models assignment', 'Test your ER model basic knowledge.', 1, 1, 2, 3),
  ('Intro to Data Models assignment', 'Test your data models basic knowledge.', 1, 1, 3, 3)
RETURNING *;

 * postgresql://ez2262:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
0 rows affected.
10 rows affected.

[(1, 'Hello world assignment', 'Let us try coding hello world by ourselves.', 1, 1, 1),
 (1, 'Boolean values assignment', 'Test your knowledge of boolean value basics.', 1, 1, 2),
 (1, 'Boolean operators assignment', 'Let us see if you understand boolean operators.', 1, 2, 2),
 (1, 'Boolean use cases assignment', 'Assess your knowledge of boolean use cases.', 1, 3, 2),
 (1, 'If statements assignment', 'Give if statements a try yourself.', 1, 1, 3),
 (1, 'Else statements assignment', 'Give else statements a try yourself.', 1, 2, 3),
 (1, 'Else if statements assignment', 'Try else if statements', 1, 3, 3),
 (1, 'Welcome assignment', 'Ensure you understand the syllabus and other course content.', 3, 1, 1),
 (1, 'Intro to ER Models assignment', 'Test your ER model basic knowledge.', 3, 1, 2),
 (1, 'Intro to Data Models assignment', 'Test your data models basic knowledge.', 3, 1, 3)]

In [ ]:
%%sql
DELETE FROM Question;
INSERT INTO
  Question(questionNumber, questionContent, questionAnswer, questionPoints, assignmentNumber, lessonNumber, unitNumber, courseID)
VALUES
  (1, 'What is 1 OR 1?', '1', 10, 1, 2, 2, 1),
  (2, 'What is 1 AND 1', '1', 10, 1, 2, 2, 1),
  (3, 'What is 1 AND 0', '0', 10, 1, 2, 2, 1),
  (4, 'What is 1 OR 0', '1', 10, 1, 2, 2, 1),
  (5, 'What is 0 AND 0', '0', 10, 1, 2, 2, 1),
  (6, 'What is 0 OR 0', '0', 10, 1, 2, 2, 1),
  (1, 'How do you code Hello World in Java?', 'System.out.println("Hello World!");', 10, 1, 1, 1, 1),
  (1, 'What degree of academic honesty violation is giving a friend your homework answers?', 'Severe Academic Dishonesty', 10, 1, 1, 1, 3),
  (2, 'What degree of academic honesty violation is discussing a lecture with a friend?', 'Not Academic Dishonesty', 10, 1, 1, 1, 3),
  (3, 'What degree of academic honesty violation is submitting work that is not original?', 'Academic Dishonesty', 10, 1, 1, 1, 3)
RETURNING *;

 * postgresql://ez2262:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
0 rows affected.
10 rows affected.

[(1, 'What is 1 OR 1?', '1', 10, 1, 1, 2, 2),
 (2, 'What is 1 AND 1', '1', 10, 1, 1, 2, 2),
 (3, 'What is 1 AND 0', '0', 10, 1, 1, 2, 2),
 (4, 'What is 1 OR 0', '1', 10, 1, 1, 2, 2),
 (5, 'What is 0 AND 0', '0', 10, 1, 1, 2, 2),
 (6, 'What is 0 OR 0', '0', 10, 1, 1, 2, 2),
 (1, 'How do you code Hello World in Java?', 'System.out.println("Hello World!");', 10, 1, 1, 1, 1),
 (1, 'What degree of academic honesty violation is giving a friend your homework answers?', 'Severe Academic Dishonesty', 10, 3, 1, 1, 1),
 (2, 'What degree of academic honesty violation is discussing a lecture with a friend?', 'Not Academic Dishonesty', 10, 3, 1, 1, 1),
 (3, 'What degree of academic honesty violation is submitting work that is not original?', 'Academic Dishonesty', 10, 3, 1, 1, 1)]

In [ ]:
%%sql
DELETE FROM Contain_Syllabus;
INSERT INTO
  Contain_Syllabus(courseID, syllabusID)
VALUES
  (1, 1),
  (2, 2), 
  (3, 3),
  (4, 4), 
  (5, 5),
  (6, 6),
  (7, 7),
  (8, 8),
  (9, 9),
  (10, 10)
RETURNING *;

 * postgresql://ez2262:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
0 rows affected.
10 rows affected.

[(1, 1),
 (2, 2),
 (3, 3),
 (4, 4),
 (5, 5),
 (6, 6),
 (7, 7),
 (8, 8),
 (9, 9),
 (10, 10)]

In [ ]:
%%sql
--This query finds the CS course with the most number of assignments students have to complete
SELECT A.courseID
FROM Assignment A INNER JOIN Course C
ON A.courseID = C.courseID
WHERE department ='COMS'
GROUP BY A.courseID
ORDER BY COUNT(*) DESC
LIMIT 1

 * postgresql://ez2262:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.

[(1,)]

In [ ]:
%%sql
-- This query calculates the number of points a student needs to get to score an ‘A’ raw average on all Assignments in the course with courseID 1, assuming each assignment is weighted equally
SELECT 0.93*SUM(questionPoints)
FROM Question Q JOIN Course C
ON Q.courseID = C.courseID
WHERE coursenumber = 1004 AND department = 'COMS';

 * postgresql://ez2262:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.

[(Decimal('65.10'),)]

In [ ]:
%%sql
SELECT courseID
FROM Contain_Syllabus C INNER JOIN Syllabus S
ON C.syllabusID = S.syllabusID
WHERE content LIKE '%databases%'

 * postgresql://ez2262:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.

[(4,)]

In [ ]:
%%sql
-- This query finds all of the students who have not completed the vaccine requirement of the New Student Checklist
SELECT U.UNI
FROM Users U INNER JOIN NewStudentChecklist_Completed N
ON U.UNI = N.UNI
WHERE N.description='Vaccines' AND N.completed = False;

 * postgresql://ez2262:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.

[('dd1001',)]

In [ ]:
%%sql
-- This query finds the number of classes that the user with UNI ez2262 has enrolled in
SELECT COUNT(*)
FROM Enroll_Course
WHERE UNI = 'ez2262';

 * postgresql://ez2262:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.

[(4,)]

In [ ]:
%%sql
-- This query finds the 5 courses with the highest average ratings from reviews in descending order
SELECT courseID, AVG(rating) as avg_rating
FROM Reviews
GROUP BY courseID
ORDER BY AVG(rating) DESC
LIMIT 5 ;

 * postgresql://ez2262:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
5 rows affected.

[(8, Decimal('5.0000000000000000')),
 (2, Decimal('5.0000000000000000')),
 (5, Decimal('4.0000000000000000')),
 (7, Decimal('3.0000000000000000')),
 (1, Decimal('3.0000000000000000'))]

In [ ]:
%%sql
SELECT * FROM Question

 * postgresql://ez2262:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
10 rows affected.

[(1, 'What is 1 OR 1?', '1', 10, 1, 1, 2, 2),
 (2, 'What is 1 AND 1', '1', 10, 1, 1, 2, 2),
 (3, 'What is 1 AND 0', '0', 10, 1, 1, 2, 2),
 (4, 'What is 1 OR 0', '1', 10, 1, 1, 2, 2),
 (5, 'What is 0 AND 0', '0', 10, 1, 1, 2, 2),
 (6, 'What is 0 OR 0', '0', 10, 1, 1, 2, 2),
 (1, 'How do you code Hello World in Java?', 'System.out.println("Hello World!");', 10, 1, 1, 1, 1),
 (1, 'What degree of academic honesty violation is giving a friend your homework answers?', 'Severe Academic Dishonesty', 10, 3, 1, 1, 1),
 (2, 'What degree of academic honesty violation is discussing a lecture with a friend?', 'Not Academic Dishonesty', 10, 3, 1, 1, 1),
 (3, 'What degree of academic honesty violation is submitting work that is not original?', 'Academic Dishonesty', 10, 3, 1, 1, 1)]